khoih-prog/EthernetWebServer/Packages_Patches/Fab_SAM_Arduino/hardware/samd/1.9.0/boards.txt
# Generic D11D14AM
d11d14am.name=Generic D11D14AM
d11d14am.vid.0=0x16D0
d11d14am.pid.0=0x3557
d11d14am.vid.1=0x16D0
d11d14am.pid.1=0x3856
d11d14am.vid.2=0x16D0
d11d14am.pid.2=0x3B41
d11d14am.vid.3=0x16D0
d11d14am.pid.3=0x3B40
d11d14am.vid.4=0x16D0
d11d14am.pid.4=0x3A0C
d11d14am.vid.5=0x16D0
d11d14am.pid.5=0x3856
d11d14am.build.mcu=cortex-m0plus
d11d14am.build.mathlib=arm_cortexM0l_math
d11d14am.build.f_cpu=48000000L
d11d14am.build.usb_product="MT-D11"
d11d14am.build.usb_manufacturer="Fab Foundation"
d11d14am.build.board=SAMD_ZERO
d11d14am.build.core=arduino
d11d14am.build.variant=Generic_D11D14AM
d11d14am.build.variant_system_lib=
d11d14am.build.vid=0x16D0
d11d14am.upload.protocol=sam-ba
d11d14am.bootloader.tool=openocd-withbootsize
d11d14am.menu.float.default=Print & String use auto-promoted doubles only
d11d14am.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
d11d14am.menu.float.print=Print uses separate singles and doubles
d11d14am.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
d11d14am.menu.float.string=String uses separate singles and doubles
d11d14am.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
d11d14am.menu.float.both=Print & String use separate singles and doubles
d11d14am.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
d11d14am.menu.config.disabled=config.h disabled
d11d14am.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
d11d14am.menu.config.enabled=config.h enabled (mostly code size reductions)
d11d14am.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
d11d14am.menu.clock.crystal_32k=32KHZ_CRYSTAL
d11d14am.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
d11d14am.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
d11d14am.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
d11d14am.menu.clock.internal=INTERNAL_OSCILLATOR
d11d14am.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
d11d14am.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
d11d14am.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d11d14am.menu.timer.timer_732Hz=732.4Hz (16-bit)
d11d14am.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
d11d14am.menu.timer.timer_366Hz=366.2Hz (16-bit)
d11d14am.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
d11d14am.menu.timer.timer_244Hz=244.1Hz (16-bit)
d11d14am.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
d11d14am.menu.timer.timer_183Hz=183.1Hz (16-bit)
d11d14am.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
d11d14am.menu.timer.timer_146Hz=146.5Hz (16-bit)
d11d14am.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
d11d14am.menu.timer.timer_122Hz=122.1Hz (16-bit)
d11d14am.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
d11d14am.menu.timer.timer_105Hz=104.6Hz (16-bit)
d11d14am.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
d11d14am.menu.timer.timer_81Hz=81.38Hz (16-bit)
d11d14am.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
d11d14am.menu.timer.timer_61Hz=61.04Hz (16-bit)
d11d14am.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
d11d14am.menu.timer.timer_31Hz=30.52Hz (16-bit)
d11d14am.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
d11d14am.menu.timer.timer_187500Hz=187500Hz (8-bit)
d11d14am.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
d11d14am.menu.timer.timer_93750Hz=93750Hz (8-bit)
d11d14am.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
d11d14am.menu.timer.timer_62500Hz=62500Hz (8-bit)
d11d14am.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
d11d14am.menu.timer.timer_37500Hz=37500Hz (8-bit)
d11d14am.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
d11d14am.menu.timer.timer_20833Hz=20833Hz (8-bit)
d11d14am.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
d11d14am.menu.timer.timer_12500Hz=12500Hz (8-bit)
d11d14am.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
d11d14am.menu.timer.timer_7500Hz=7500Hz (8-bit)
d11d14am.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
d11d14am.menu.timer.timer_4166Hz=4166Hz (8-bit)
d11d14am.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
d11d14am.menu.timer.timer_2930Hz=2930Hz (8-bit)
d11d14am.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
d11d14am.menu.timer.timer_1465Hz=1465Hz (8-bit)
d11d14am.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
d11d14am.build.extra_flags=-D__SAMD11D14AM__ {build.usb_flags} -DARM_MATH_CM0PLUS
d11d14am.build.ldscript=flash_16KB.ld
d11d14am.build.openocdscript=openocd_scripts/SAMD11D14AM.cfg
d11d14am.bootloader.file=zero/binaries/sam_ba_SAMD11D14AM.bin
d11d14am.menu.bootloader.4kb=4KB_BOOTLOADER
d11d14am.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
d11d14am.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
d11d14am.menu.bootloader.4kb.upload.tool=Fab_SAM_Arduino:bossac
d11d14am.menu.bootloader.4kb.upload.use_1200bps_touch=true
d11d14am.menu.bootloader.4kb.upload.wait_for_upload_port=true
d11d14am.menu.bootloader.4kb.upload.native_usb=true
d11d14am.menu.bootloader.4kb.upload.maximum_size=12288
d11d14am.menu.bootloader.4kb.upload.offset=0x1000
d11d14am.menu.bootloader.0kb=NO_BOOTLOADER
d11d14am.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d11d14am.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d11d14am.menu.bootloader.0kb.upload.tool=openocd-withbootsize
d11d14am.menu.bootloader.0kb.upload.use_1200bps_touch=false
d11d14am.menu.bootloader.0kb.upload.wait_for_upload_port=false
d11d14am.menu.bootloader.0kb.upload.native_usb=false
d11d14am.menu.bootloader.0kb.upload.maximum_size=16384
d11d14am.menu.bootloader.0kb.upload.offset=0x0000
d11d14am.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
d11d14am.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d11d14am.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d11d14am.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
d11d14am.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
d11d14am.menu.serial.no_uart.build.serialcom_uart=NO_UART
d11d14am.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
d11d14am.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
d11d14am.menu.serial.two_uart=TWO_UART_ONE_WIRE_NO_SPI
d11d14am.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d11d14am.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
d11d14am.menu.serial.two_uart.build.serialcom_spi=NO_SPI
d11d14am.menu.usb.cdc=CDC_ONLY
d11d14am.menu.usb.cdc.build.usbcom=CDC_ONLY
d11d14am.menu.usb.cdc.build.pid=0x3557
d11d14am.menu.usb.cdc_hid=CDC_HID
d11d14am.menu.usb.cdc_hid.build.usbcom=CDC_HID
d11d14am.menu.usb.cdc_hid.build.pid=0x3856
d11d14am.menu.usb.withcdc=WITH_CDC
d11d14am.menu.usb.withcdc.build.usbcom=WITH_CDC
d11d14am.menu.usb.withcdc.build.pid=0x3B41
d11d14am.menu.usb.hid=HID_ONLY
d11d14am.menu.usb.hid.build.usbcom=HID_ONLY
d11d14am.menu.usb.hid.build.pid=0x3B40
d11d14am.menu.usb.nocdc=WITHOUT_CDC
d11d14am.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d11d14am.menu.usb.nocdc.build.pid=0x3A0C
d11d14am.menu.usb.none=USB_DISABLED
d11d14am.menu.usb.none.build.usbcom=USB_DISABLED
d11d14am.menu.usb.none.build.pid=0x3856

