khoih-prog/EthernetWebServer/Packages_Patches/Fab_SAM_Arduino/hardware/samd/1.9.0/boards.txt
# Generic x21E
x21e.name=Generic x21E
x21e.vid.0=0x16D0
x21e.pid.0=0x4557
x21e.vid.1=0x16D0
x21e.pid.1=0x4856
x21e.vid.2=0x16D0
x21e.pid.2=0x4B41
x21e.vid.3=0x16D0
x21e.pid.3=0x4B40
x21e.vid.4=0x16D0
x21e.pid.4=0x4A0C
x21e.vid.5=0x16D0
x21e.pid.5=0x4856
x21e.build.mcu=cortex-m0plus
x21e.build.mathlib=arm_cortexM0l_math
x21e.build.f_cpu=48000000L
x21e.build.usb_product="x21E"
x21e.build.usb_manufacturer="Fab Foundation"
x21e.build.board=SAMD_ZERO
x21e.build.core=arduino
x21e.build.variant=Generic_x21E
x21e.build.variant_system_lib=
x21e.build.vid=0x16D0
x21e.upload.protocol=sam-ba
x21e.bootloader.tool=openocd-withbootsize
x21e.menu.float.default=Print & String use auto-promoted doubles only
x21e.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
x21e.menu.float.print=Print uses separate singles and doubles
x21e.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
x21e.menu.float.string=String uses separate singles and doubles
x21e.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
x21e.menu.float.both=Print & String use separate singles and doubles
x21e.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
x21e.menu.config.disabled=config.h disabled
x21e.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
x21e.menu.config.enabled=config.h enabled (mostly code size reductions)
x21e.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
x21e.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
x21e.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
x21e.menu.clock.internal=INTERNAL_OSCILLATOR
x21e.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
x21e.menu.clock.crystal_32k=32KHZ_CRYSTAL
x21e.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
x21e.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
x21e.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
x21e.menu.timer.timer_732Hz=732.4Hz (16-bit)
x21e.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
x21e.menu.timer.timer_366Hz=366.2Hz (16-bit)
x21e.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
x21e.menu.timer.timer_244Hz=244.1Hz (16-bit)
x21e.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
x21e.menu.timer.timer_183Hz=183.1Hz (16-bit)
x21e.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
x21e.menu.timer.timer_146Hz=146.5Hz (16-bit)
x21e.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
x21e.menu.timer.timer_122Hz=122.1Hz (16-bit)
x21e.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
x21e.menu.timer.timer_105Hz=104.6Hz (16-bit)
x21e.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
x21e.menu.timer.timer_81Hz=81.38Hz (16-bit)
x21e.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
x21e.menu.timer.timer_61Hz=61.04Hz (16-bit)
x21e.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
x21e.menu.timer.timer_31Hz=30.52Hz (16-bit)
x21e.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
x21e.menu.timer.timer_187500Hz=187500Hz (8-bit)
x21e.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
x21e.menu.timer.timer_93750Hz=93750Hz (8-bit)
x21e.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
x21e.menu.timer.timer_62500Hz=62500Hz (8-bit)
x21e.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
x21e.menu.timer.timer_37500Hz=37500Hz (8-bit)
x21e.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
x21e.menu.timer.timer_20833Hz=20833Hz (8-bit)
x21e.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
x21e.menu.timer.timer_12500Hz=12500Hz (8-bit)
x21e.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
x21e.menu.timer.timer_7500Hz=7500Hz (8-bit)
x21e.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
x21e.menu.timer.timer_4166Hz=4166Hz (8-bit)
x21e.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
x21e.menu.timer.timer_2930Hz=2930Hz (8-bit)
x21e.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
x21e.menu.timer.timer_1465Hz=1465Hz (8-bit)
x21e.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
x21e.menu.cpu.samd21e15a=SAMD21E15A
x21e.menu.cpu.samd21e15a.upload.maximum_size=24576
x21e.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.samd21e15a.build.ldscript=flash_32KB.ld
x21e.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
x21e.menu.cpu.samd21e15a.bootloader.file=zero/binaries/sam_ba_SAMD21E15A.bin
x21e.menu.cpu.samd21e16a=SAMD21E16A
x21e.menu.cpu.samd21e16a.upload.maximum_size=57344
x21e.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.samd21e16a.build.ldscript=flash_64KB.ld
x21e.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
x21e.menu.cpu.samd21e16a.bootloader.file=zero/binaries/sam_ba_SAMD21E16A.bin
x21e.menu.cpu.samd21e17a=SAMD21E17A
x21e.menu.cpu.samd21e17a.upload.maximum_size=122880
x21e.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.samd21e17a.build.ldscript=flash_128KB.ld
x21e.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
x21e.menu.cpu.samd21e17a.bootloader.file=zero/binaries/sam_ba_SAMD21E17A.bin
x21e.menu.cpu.samd21e18a=SAMD21E18A
x21e.menu.cpu.samd21e18a.upload.maximum_size=253952
x21e.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.samd21e18a.build.ldscript=flash_256KB.ld
x21e.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
x21e.menu.cpu.samd21e18a.bootloader.file=zero/binaries/sam_ba_SAMD21E18A.bin
x21e.menu.cpu.saml21e15b=SAML21E15B
x21e.menu.cpu.saml21e15b.upload.maximum_size=24576
x21e.menu.cpu.saml21e15b.build.extra_flags=-D__SAML21E15B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.saml21e15b.build.ldscript=flash_32KB.ld
x21e.menu.cpu.saml21e15b.build.openocdscript=openocd_scripts/SAML21E15B.cfg
x21e.menu.cpu.saml21e15b.bootloader.file=zero/binaries/sam_ba_SAML21E15B.bin
x21e.menu.cpu.saml21e16b=SAML21E16B
x21e.menu.cpu.saml21e16b.upload.maximum_size=57344
x21e.menu.cpu.saml21e16b.build.extra_flags=-D__SAML21E16B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.saml21e16b.build.ldscript=flash_64KB.ld
x21e.menu.cpu.saml21e16b.build.openocdscript=openocd_scripts/SAML21E16B.cfg
x21e.menu.cpu.saml21e16b.bootloader.file=zero/binaries/sam_ba_SAML21E16B.bin
x21e.menu.cpu.saml21e17b=SAML21E17B
x21e.menu.cpu.saml21e17b.upload.maximum_size=122880
x21e.menu.cpu.saml21e17b.build.extra_flags=-D__SAML21E17B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.saml21e17b.build.ldscript=flash_128KB.ld
x21e.menu.cpu.saml21e17b.build.openocdscript=openocd_scripts/SAML21E17B.cfg
x21e.menu.cpu.saml21e17b.bootloader.file=zero/binaries/sam_ba_SAML21E17B.bin
x21e.menu.cpu.saml21e18b=SAML21E18B
x21e.menu.cpu.saml21e18b.upload.maximum_size=253952
x21e.menu.cpu.saml21e18b.build.extra_flags=-D__SAML21E18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21e.menu.cpu.saml21e18b.build.ldscript=flash_256KB.ld
x21e.menu.cpu.saml21e18b.build.openocdscript=openocd_scripts/SAML21E18B.cfg
x21e.menu.cpu.saml21e18b.bootloader.file=zero/binaries/sam_ba_SAML21E18B.bin
x21e.menu.cpu.samc21e15a=SAMC21E15A
x21e.menu.cpu.samc21e15a.upload.maximum_size=24576
x21e.menu.cpu.samc21e15a.build.extra_flags=-D__SAMC21E15A__ -DARM_MATH_CM0PLUS
x21e.menu.cpu.samc21e15a.build.ldscript=flash_32KB.ld
x21e.menu.cpu.samc21e15a.build.openocdscript=openocd_scripts/SAMC21E15A.cfg
x21e.menu.cpu.samc21e15a.bootloader.file=zero/binaries/sam_ba_SAMC21E15A.bin
x21e.menu.cpu.samc21e16a=SAMC21E16A
x21e.menu.cpu.samc21e16a.upload.maximum_size=57344
x21e.menu.cpu.samc21e16a.build.extra_flags=-D__SAMC21E16A__ -DARM_MATH_CM0PLUS
x21e.menu.cpu.samc21e16a.build.ldscript=flash_64KB.ld
x21e.menu.cpu.samc21e16a.build.openocdscript=openocd_scripts/SAMC21E16A.cfg
x21e.menu.cpu.samc21e16a.bootloader.file=zero/binaries/sam_ba_SAMC21E16A.bin
x21e.menu.cpu.samc21e17a=SAMC21E17A
x21e.menu.cpu.samc21e17a.upload.maximum_size=122880
x21e.menu.cpu.samc21e17a.build.extra_flags=-D__SAMC21E17A__ -DARM_MATH_CM0PLUS
x21e.menu.cpu.samc21e17a.build.ldscript=flash_128KB.ld
x21e.menu.cpu.samc21e17a.build.openocdscript=openocd_scripts/SAMC21E17A.cfg
x21e.menu.cpu.samc21e17a.bootloader.file=zero/binaries/sam_ba_SAMC21E17A.bin
x21e.menu.cpu.samc21e18a=SAMC21E18A
x21e.menu.cpu.samc21e18a.upload.maximum_size=253952
x21e.menu.cpu.samc21e18a.build.extra_flags=-D__SAMC21E18A__ -DARM_MATH_CM0PLUS
x21e.menu.cpu.samc21e18a.build.ldscript=flash_256KB.ld
x21e.menu.cpu.samc21e18a.build.openocdscript=openocd_scripts/SAMC21E18A.cfg
x21e.menu.cpu.samc21e18a.bootloader.file=zero/binaries/sam_ba_SAMC21E18A.bin
x21e.menu.bootloader.8kb=8KB_BOOTLOADER
x21e.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
x21e.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
x21e.menu.bootloader.8kb.upload.tool=Fab_SAM_Arduino:bossac
x21e.menu.bootloader.8kb.upload.use_1200bps_touch=true
x21e.menu.bootloader.8kb.upload.wait_for_upload_port=true
x21e.menu.bootloader.8kb.upload.native_usb=true
x21e.menu.bootloader.8kb.upload.offset=0x2000
x21e.menu.bootloader.16kb=16KB_BOOTLOADER
x21e.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
x21e.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
x21e.menu.bootloader.16kb.upload.tool=Fab_SAM_Arduino:bossac
x21e.menu.bootloader.16kb.upload.use_1200bps_touch=true
x21e.menu.bootloader.16kb.upload.wait_for_upload_port=true
x21e.menu.bootloader.16kb.upload.native_usb=true
x21e.menu.bootloader.16kb.upload.offset=0x4000
x21e.menu.bootloader.0kb=NO_BOOTLOADER
x21e.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
x21e.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
x21e.menu.bootloader.0kb.upload.tool=openocd-withbootsize
x21e.menu.bootloader.0kb.upload.use_1200bps_touch=false
x21e.menu.bootloader.0kb.upload.wait_for_upload_port=false
x21e.menu.bootloader.0kb.upload.native_usb=false
x21e.menu.bootloader.0kb.upload.offset=0x0000
x21e.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
x21e.menu.serial.one_uart.build.serialcom_uart=ONE_UART
x21e.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
x21e.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
x21e.menu.serial.one_uart_one_wire_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
x21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
x21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
x21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
x21e.menu.serial.one_uart_two_wire_one_spi=ONE_UART_TWO_WIRE_ONE_SPI
x21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
x21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
x21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
x21e.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
x21e.menu.serial.two_uart.build.serialcom_uart=TWO_UART
x21e.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
x21e.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
x21e.menu.serial.three_uart_one_wire_no_spi=THREE_UART_ONE_WIRE_NO_SPI
x21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
x21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
x21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
x21e.menu.serial.three_uart_no_wire_one_spi=THREE_UART_NO_WIRE_ONE_SPI
x21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
x21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
x21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
x21e.menu.serial.four_uart=FOUR_UART_NO_WIRE_NO_SPI
x21e.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
x21e.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
x21e.menu.serial.four_uart.build.serialcom_spi=NO_SPI
x21e.menu.serial.no_uart_one_wire_two_spi=NO_UART_ONE_WIRE_TWO_SPI
x21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
x21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
x21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
x21e.menu.serial.four_uart_one_wire_one_spi=FOUR_UART_ONE_WIRE_ONE_SPI (L21 only)
x21e.menu.serial.four_uart_one_wire_one_spi.build.serialcom_uart=FOUR_UART
x21e.menu.serial.four_uart_one_wire_one_spi.build.serialcom_wire=ONE_WIRE
x21e.menu.serial.four_uart_one_wire_one_spi.build.serialcom_spi=ONE_SPI
x21e.menu.serial.five_uart_no_wire_one_spi=FIVE_UART_NO_WIRE_ONE_SPI (L21 only)
x21e.menu.serial.five_uart_no_wire_one_spi.build.serialcom_uart=FIVE_UART
x21e.menu.serial.five_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
x21e.menu.serial.five_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
x21e.menu.serial.five_uart_one_wire_no_spi=FIVE_UART_ONE_WIRE_NO_SPI (L21 only)
x21e.menu.serial.five_uart_one_wire_no_spi.build.serialcom_uart=FIVE_UART
x21e.menu.serial.five_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
x21e.menu.serial.five_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
x21e.menu.serial.six_uart=SIX_UART_NO_WIRE_NO_SPI (L21 only)
x21e.menu.serial.six_uart.build.serialcom_uart=SIX_UART
x21e.menu.serial.six_uart.build.serialcom_wire=NO_WIRE
x21e.menu.serial.six_uart.build.serialcom_spi=NO_SPI
x21e.menu.usb.cdc=CDC_ONLY
x21e.menu.usb.cdc.build.usbcom=CDC_ONLY
x21e.menu.usb.cdc.build.pid=0x4557
x21e.menu.usb.cdc_hid=CDC_HID
x21e.menu.usb.cdc_hid.build.usbcom=CDC_HID
x21e.menu.usb.cdc_hid.build.pid=0x4856
x21e.menu.usb.withcdc=WITH_CDC
x21e.menu.usb.withcdc.build.usbcom=WITH_CDC
x21e.menu.usb.withcdc.build.pid=0x4B41
x21e.menu.usb.hid=HID_ONLY
x21e.menu.usb.hid.build.usbcom=HID_ONLY
x21e.menu.usb.hid.build.pid=0x4B40
x21e.menu.usb.nocdc=WITHOUT_CDC
x21e.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
x21e.menu.usb.nocdc.build.pid=0x4A0C
x21e.menu.usb.none=USB_DISABLED
x21e.menu.usb.none.build.usbcom=USB_DISABLED
x21e.menu.usb.none.build.pid=0x4856

