khoih-prog/EthernetWebServer/Packages_Patches/Fab_SAM_Arduino/hardware/samd/1.9.0/boards.txt
# Generic x21G
x21g.name=Generic x21G
x21g.vid.0=0x16D0
x21g.pid.0=0x5557
x21g.vid.1=0x16D0
x21g.pid.1=0x5856
x21g.vid.2=0x16D0
x21g.pid.2=0x5B41
x21g.vid.3=0x16D0
x21g.pid.3=0x5B40
x21g.vid.4=0x16D0
x21g.pid.4=0x5A0C
x21g.vid.5=0x16D0
x21g.pid.5=0x5856
x21g.build.usb_manufacturer="Fab Foundation"
x21g.build.board=SAMD_ZERO
x21g.build.core=arduino
x21g.build.variant=Generic_xx1G
x21g.build.variant_system_lib=
x21g.build.vid=0x16D0
x21g.upload.protocol=sam-ba
x21g.bootloader.tool=openocd-withbootsize
x21g.menu.float.default=Print & String use auto-promoted doubles only
x21g.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
x21g.menu.float.print=Print uses separate singles and doubles
x21g.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
x21g.menu.float.string=String uses separate singles and doubles
x21g.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
x21g.menu.float.both=Print & String use separate singles and doubles
x21g.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
x21g.menu.config.disabled=config.h disabled
x21g.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
x21g.menu.config.enabled=config.h enabled (mostly code size reductions)
x21g.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
x21g.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
x21g.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
x21g.menu.clock.internal=INTERNAL_OSCILLATOR
x21g.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
x21g.menu.clock.crystal_32k=32KHZ_CRYSTAL
x21g.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
x21g.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
x21g.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
x21g.menu.timer.timer_732Hz=732.4Hz (16-bit)
x21g.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
x21g.menu.timer.timer_366Hz=366.2Hz (16-bit)
x21g.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
x21g.menu.timer.timer_244Hz=244.1Hz (16-bit)
x21g.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
x21g.menu.timer.timer_183Hz=183.1Hz (16-bit)
x21g.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
x21g.menu.timer.timer_146Hz=146.5Hz (16-bit)
x21g.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
x21g.menu.timer.timer_122Hz=122.1Hz (16-bit)
x21g.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
x21g.menu.timer.timer_105Hz=104.6Hz (16-bit)
x21g.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
x21g.menu.timer.timer_81Hz=81.38Hz (16-bit)
x21g.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
x21g.menu.timer.timer_61Hz=61.04Hz (16-bit)
x21g.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
x21g.menu.timer.timer_31Hz=30.52Hz (16-bit)
x21g.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
x21g.menu.timer.timer_187500Hz=187500Hz (8-bit)
x21g.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
x21g.menu.timer.timer_93750Hz=93750Hz (8-bit)
x21g.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
x21g.menu.timer.timer_62500Hz=62500Hz (8-bit)
x21g.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
x21g.menu.timer.timer_37500Hz=37500Hz (8-bit)
x21g.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
x21g.menu.timer.timer_20833Hz=20833Hz (8-bit)
x21g.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
x21g.menu.timer.timer_12500Hz=12500Hz (8-bit)
x21g.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
x21g.menu.timer.timer_7500Hz=7500Hz (8-bit)
x21g.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
x21g.menu.timer.timer_4166Hz=4166Hz (8-bit)
x21g.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
x21g.menu.timer.timer_2930Hz=2930Hz (8-bit)
x21g.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
x21g.menu.timer.timer_1465Hz=1465Hz (8-bit)
x21g.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
x21g.menu.cpu.samd21g17a=SAMD21G17A
x21g.menu.cpu.samd21g17a.upload.maximum_size=122880
x21g.menu.cpu.samd21g17a.build.mcu=cortex-m0plus
x21g.menu.cpu.samd21g17a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samd21g17a.build.f_cpu=48000000L
x21g.menu.cpu.samd21g17a.build.usb_product="D21"
x21g.menu.cpu.samd21g17a.build.extra_flags=-D__SAMD21G17A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.samd21g17a.build.ldscript=flash_128KB.ld
x21g.menu.cpu.samd21g17a.build.openocdscript=openocd_scripts/SAMD21G17A.cfg
x21g.menu.cpu.samd21g17a.bootloader.file=zero/binaries/sam_ba_SAMD21G17A.bin
x21g.menu.cpu.samd21g18a=SAMD21G18A
x21g.menu.cpu.samd21g18a.upload.maximum_size=253952
x21g.menu.cpu.samd21g18a.build.mcu=cortex-m0plus
x21g.menu.cpu.samd21g18a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samd21g18a.build.f_cpu=48000000L
x21g.menu.cpu.samd21g18a.build.usb_product="D21"
x21g.menu.cpu.samd21g18a.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.samd21g18a.build.ldscript=flash_256KB.ld
x21g.menu.cpu.samd21g18a.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
x21g.menu.cpu.samd21g18a.bootloader.file=zero/binaries/sam_ba_SAMD21G18A.bin
x21g.menu.cpu.samd21g15a=SAMD21G15A
x21g.menu.cpu.samd21g15a.upload.maximum_size=24576
x21g.menu.cpu.samd21g15a.build.mcu=cortex-m0plus
x21g.menu.cpu.samd21g15a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samd21g15a.build.f_cpu=48000000L
x21g.menu.cpu.samd21g15a.build.usb_product="D21"
x21g.menu.cpu.samd21g15a.build.extra_flags=-D__SAMD21G15A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.samd21g15a.build.ldscript=flash_32KB.ld
x21g.menu.cpu.samd21g15a.build.openocdscript=openocd_scripts/SAMD21G15A.cfg
x21g.menu.cpu.samd21g15a.bootloader.file=zero/binaries/sam_ba_SAMD21G15A.bin
x21g.menu.cpu.samd21g16a=SAMD21G16A
x21g.menu.cpu.samd21g16a.upload.maximum_size=57344
x21g.menu.cpu.samd21g16a.build.mcu=cortex-m0plus
x21g.menu.cpu.samd21g16a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samd21g16a.build.f_cpu=48000000L
x21g.menu.cpu.samd21g16a.build.usb_product="D21"
x21g.menu.cpu.samd21g16a.build.extra_flags=-D__SAMD21G16A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.samd21g16a.build.ldscript=flash_64KB.ld
x21g.menu.cpu.samd21g16a.build.openocdscript=openocd_scripts/SAMD21G16A.cfg
x21g.menu.cpu.samd21g16a.bootloader.file=zero/binaries/sam_ba_SAMD21G16A.bin
x21g.menu.cpu.saml21g17b=SAML21G17B
x21g.menu.cpu.saml21g17b.upload.maximum_size=122880
x21g.menu.cpu.saml21g17b.build.mcu=cortex-m0plus
x21g.menu.cpu.saml21g17b.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.saml21g17b.build.f_cpu=48000000L
x21g.menu.cpu.saml21g17b.build.usb_product="L21"
x21g.menu.cpu.saml21g17b.build.extra_flags=-D__SAML21G17B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.saml21g17b.build.ldscript=flash_128KB.ld
x21g.menu.cpu.saml21g17b.build.openocdscript=openocd_scripts/SAML21G17B.cfg
x21g.menu.cpu.saml21g17b.bootloader.file=zero/binaries/sam_ba_SAML21G17B.bin
x21g.menu.cpu.saml21g18b=SAML21G18B
x21g.menu.cpu.saml21g18b.upload.maximum_size=253952
x21g.menu.cpu.saml21g18b.build.mcu=cortex-m0plus
x21g.menu.cpu.saml21g18b.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.saml21g18b.build.f_cpu=48000000L
x21g.menu.cpu.saml21g18b.build.usb_product="L21"
x21g.menu.cpu.saml21g18b.build.extra_flags=-D__SAML21G18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.saml21g18b.build.ldscript=flash_256KB.ld
x21g.menu.cpu.saml21g18b.build.openocdscript=openocd_scripts/SAML21G18B.cfg
x21g.menu.cpu.saml21g18b.bootloader.file=zero/binaries/sam_ba_SAML21G18B.bin
x21g.menu.cpu.saml21g15b=SAML21G15B
x21g.menu.cpu.saml21g15b.upload.maximum_size=24576
x21g.menu.cpu.saml21g15b.build.mcu=cortex-m0plus
x21g.menu.cpu.saml21g15b.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.saml21g15b.build.f_cpu=48000000L
x21g.menu.cpu.saml21g15b.build.usb_product="L21"
x21g.menu.cpu.saml21g15b.build.extra_flags=-D__SAML21G15B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.saml21g15b.build.ldscript=flash_32KB.ld
x21g.menu.cpu.saml21g15b.build.openocdscript=openocd_scripts/SAML21G15B.cfg
x21g.menu.cpu.saml21g15b.bootloader.file=zero/binaries/sam_ba_SAML21G15B.bin
x21g.menu.cpu.saml21g16b=SAML21G16B
x21g.menu.cpu.saml21g16b.upload.maximum_size=57344
x21g.menu.cpu.saml21g16b.build.mcu=cortex-m0plus
x21g.menu.cpu.saml21g16b.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.saml21g16b.build.f_cpu=48000000L
x21g.menu.cpu.saml21g16b.build.usb_product="L21"
x21g.menu.cpu.saml21g16b.build.extra_flags=-D__SAML21G16B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21g.menu.cpu.saml21g16b.build.ldscript=flash_64KB.ld
x21g.menu.cpu.saml21g16b.build.openocdscript=openocd_scripts/SAML21G16B.cfg
x21g.menu.cpu.saml21g16b.bootloader.file=zero/binaries/sam_ba_SAML21G16B.bin
x21g.menu.cpu.samc21g17a=SAMC21G17A
x21g.menu.cpu.samc21g17a.upload.maximum_size=122880
x21g.menu.cpu.samc21g17a.build.mcu=cortex-m0plus
x21g.menu.cpu.samc21g17a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samc21g17a.build.f_cpu=48000000L
x21g.menu.cpu.samc21g17a.build.usb_product="C21"
x21g.menu.cpu.samc21g17a.build.extra_flags=-D__SAMC21G17A__ -DARM_MATH_CM0PLUS
x21g.menu.cpu.samc21g17a.build.ldscript=flash_128KB.ld
x21g.menu.cpu.samc21g17a.build.openocdscript=openocd_scripts/SAMC21G17A.cfg
x21g.menu.cpu.samc21g17a.bootloader.file=zero/binaries/sam_ba_SAMC21G17A.bin
x21g.menu.cpu.samc21g18a=SAMC21G18A
x21g.menu.cpu.samc21g18a.upload.maximum_size=253952
x21g.menu.cpu.samc21g18a.build.mcu=cortex-m0plus
x21g.menu.cpu.samc21g18a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samc21g18a.build.f_cpu=48000000L
x21g.menu.cpu.samc21g18a.build.usb_product="C21"
x21g.menu.cpu.samc21g18a.build.extra_flags=-D__SAMC21G18A__ -DARM_MATH_CM0PLUS
x21g.menu.cpu.samc21g18a.build.ldscript=flash_256KB.ld
x21g.menu.cpu.samc21g18a.build.openocdscript=openocd_scripts/SAMC21G18A.cfg
x21g.menu.cpu.samc21g18a.bootloader.file=zero/binaries/sam_ba_SAMC21G18A.bin
x21g.menu.cpu.samc21g15a=SAMC21G15A
x21g.menu.cpu.samc21g15a.upload.maximum_size=24576
x21g.menu.cpu.samc21g15a.build.mcu=cortex-m0plus
x21g.menu.cpu.samc21g15a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samc21g15a.build.f_cpu=48000000L
x21g.menu.cpu.samc21g15a.build.usb_product="C21"
x21g.menu.cpu.samc21g15a.build.extra_flags=-D__SAMC21G15A__ -DARM_MATH_CM0PLUS
x21g.menu.cpu.samc21g15a.build.ldscript=flash_32KB.ld
x21g.menu.cpu.samc21g15a.build.openocdscript=openocd_scripts/SAMC21G15A.cfg
x21g.menu.cpu.samc21g15a.bootloader.file=zero/binaries/sam_ba_SAMC21G15A.bin
x21g.menu.cpu.samc21g16a=SAMC21G16A
x21g.menu.cpu.samc21g16a.upload.maximum_size=57344
x21g.menu.cpu.samc21g16a.build.mcu=cortex-m0plus
x21g.menu.cpu.samc21g16a.build.mathlib=arm_cortexM0l_math
x21g.menu.cpu.samc21g16a.build.f_cpu=48000000L
x21g.menu.cpu.samc21g16a.build.usb_product="C21"
x21g.menu.cpu.samc21g16a.build.extra_flags=-D__SAMC21G16A__ -DARM_MATH_CM0PLUS
x21g.menu.cpu.samc21g16a.build.ldscript=flash_64KB.ld
x21g.menu.cpu.samc21g16a.build.openocdscript=openocd_scripts/SAMC21G16A.cfg
x21g.menu.cpu.samc21g16a.bootloader.file=zero/binaries/sam_ba_SAMC21G16A.bin
x21g.menu.bootloader.8kb=8KB_BOOTLOADER
x21g.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
x21g.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
x21g.menu.bootloader.8kb.upload.tool=Fab_SAM_Arduino:bossac
x21g.menu.bootloader.8kb.upload.use_1200bps_touch=true
x21g.menu.bootloader.8kb.upload.wait_for_upload_port=true
x21g.menu.bootloader.8kb.upload.native_usb=true
x21g.menu.bootloader.8kb.upload.offset=0x2000
x21g.menu.bootloader.16kb=16KB_BOOTLOADER
x21g.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
x21g.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
x21g.menu.bootloader.16kb.upload.tool=Fab_SAM_Arduino:bossac
x21g.menu.bootloader.16kb.upload.use_1200bps_touch=true
x21g.menu.bootloader.16kb.upload.wait_for_upload_port=true
x21g.menu.bootloader.16kb.upload.native_usb=true
x21g.menu.bootloader.16kb.upload.offset=0x4000
x21g.menu.bootloader.0kb=NO_BOOTLOADER
x21g.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
x21g.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
x21g.menu.bootloader.0kb.upload.tool=openocd-withbootsize
x21g.menu.bootloader.0kb.upload.use_1200bps_touch=false
x21g.menu.bootloader.0kb.upload.wait_for_upload_port=false
x21g.menu.bootloader.0kb.upload.native_usb=false
x21g.menu.bootloader.0kb.upload.offset=0x0000
x21g.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
x21g.menu.serial.one_uart.build.serialcom_uart=ONE_UART
x21g.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
x21g.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
x21g.menu.serial.one_uart_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
x21g.menu.serial.one_uart_two_spi.build.serialcom_uart=ONE_UART
x21g.menu.serial.one_uart_two_spi.build.serialcom_wire=ONE_WIRE
x21g.menu.serial.one_uart_two_spi.build.serialcom_spi=TWO_SPI
x21g.menu.serial.one_uart_two_wire=ONE_UART_TWO_WIRE_ONE_SPI
x21g.menu.serial.one_uart_two_wire.build.serialcom_uart=ONE_UART
x21g.menu.serial.one_uart_two_wire.build.serialcom_wire=TWO_WIRE
x21g.menu.serial.one_uart_two_wire.build.serialcom_spi=ONE_SPI
x21g.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
x21g.menu.serial.two_uart.build.serialcom_uart=TWO_UART
x21g.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
x21g.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
x21g.menu.serial.two_uart_two_spi=TWO_UART_ONE_WIRE_TWO_SPI
x21g.menu.serial.two_uart_two_spi.build.serialcom_uart=TWO_UART
x21g.menu.serial.two_uart_two_spi.build.serialcom_wire=ONE_WIRE
x21g.menu.serial.two_uart_two_spi.build.serialcom_spi=TWO_SPI
x21g.menu.serial.two_uart_two_wire=TWO_UART_TWO_WIRE_ONE_SPI
x21g.menu.serial.two_uart_two_wire.build.serialcom_uart=TWO_UART
x21g.menu.serial.two_uart_two_wire.build.serialcom_wire=TWO_WIRE
x21g.menu.serial.two_uart_two_wire.build.serialcom_spi=ONE_SPI
x21g.menu.serial.three_uart=THREE_UART_ONE_WIRE_ONE_SPI
x21g.menu.serial.three_uart.build.serialcom_uart=THREE_UART
x21g.menu.serial.three_uart.build.serialcom_wire=ONE_WIRE
x21g.menu.serial.three_uart.build.serialcom_spi=ONE_SPI
x21g.menu.serial.three_uart_two_spi=THREE_UART_ONE_WIRE_TWO_SPI
x21g.menu.serial.three_uart_two_spi.build.serialcom_uart=THREE_UART
x21g.menu.serial.three_uart_two_spi.build.serialcom_wire=ONE_WIRE
x21g.menu.serial.three_uart_two_spi.build.serialcom_spi=TWO_SPI
x21g.menu.serial.three_uart_two_wire=THREE_UART_TWO_WIRE_ONE_SPI
x21g.menu.serial.three_uart_two_wire.build.serialcom_uart=THREE_UART
x21g.menu.serial.three_uart_two_wire.build.serialcom_wire=TWO_WIRE
x21g.menu.serial.three_uart_two_wire.build.serialcom_spi=ONE_SPI
x21g.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
x21g.menu.serial.no_uart.build.serialcom_uart=NO_UART
x21g.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
x21g.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
x21g.menu.usb.cdc=CDC_ONLY
x21g.menu.usb.cdc.build.usbcom=CDC_ONLY
x21g.menu.usb.cdc.build.pid=0x5557
x21g.menu.usb.cdc_hid=CDC_HID
x21g.menu.usb.cdc_hid.build.usbcom=CDC_HID
x21g.menu.usb.cdc_hid.build.pid=0x5856
x21g.menu.usb.withcdc=WITH_CDC
x21g.menu.usb.withcdc.build.usbcom=WITH_CDC
x21g.menu.usb.withcdc.build.pid=0x5B41
x21g.menu.usb.hid=HID_ONLY
x21g.menu.usb.hid.build.usbcom=HID_ONLY
x21g.menu.usb.hid.build.pid=0x5B40
x21g.menu.usb.nocdc=WITHOUT_CDC
x21g.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
x21g.menu.usb.nocdc.build.pid=0x5A0C
x21g.menu.usb.none=USB_DISABLED
x21g.menu.usb.none.build.usbcom=USB_DISABLED
x21g.menu.usb.none.build.pid=0x5856

