khoih-prog/EthernetWebServer/Packages_Patches/Fab_SAM_Arduino/hardware/samd/1.9.0/boards.txt
# Generic x21J
x21j.name=Generic x21J
x21j.vid.0=0x16D0
x21j.pid.0=0x6557
x21j.vid.1=0x16D0
x21j.pid.1=0x6856
x21j.vid.2=0x16D0
x21j.pid.2=0x6B41
x21j.vid.3=0x16D0
x21j.pid.3=0x6B40
x21j.vid.4=0x16D0
x21j.pid.4=0x6A0C
x21j.vid.5=0x16D0
x21j.pid.5=0x6856
x21j.build.usb_manufacturer="Fab Foundation"
x21j.build.board=SAMD_ZERO
x21j.build.core=arduino
x21j.build.variant=Generic_xx1J
x21j.build.variant_system_lib=
x21j.build.vid=0x16D0
x21j.upload.protocol=sam-ba
x21j.bootloader.tool=openocd-withbootsize
x21j.menu.float.default=Print & String use auto-promoted doubles only
x21j.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
x21j.menu.float.print=Print uses separate singles and doubles
x21j.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
x21j.menu.float.string=String uses separate singles and doubles
x21j.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
x21j.menu.float.both=Print & String use separate singles and doubles
x21j.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
x21j.menu.config.disabled=config.h disabled
x21j.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
x21j.menu.config.enabled=config.h enabled (mostly code size reductions)
x21j.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
x21j.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
x21j.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
x21j.menu.clock.internal=INTERNAL_OSCILLATOR
x21j.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
x21j.menu.clock.crystal_32k=32KHZ_CRYSTAL
x21j.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
x21j.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
x21j.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
x21j.menu.timer.timer_732Hz=732.4Hz (16-bit)
x21j.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
x21j.menu.timer.timer_366Hz=366.2Hz (16-bit)
x21j.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
x21j.menu.timer.timer_244Hz=244.1Hz (16-bit)
x21j.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
x21j.menu.timer.timer_183Hz=183.1Hz (16-bit)
x21j.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
x21j.menu.timer.timer_146Hz=146.5Hz (16-bit)
x21j.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
x21j.menu.timer.timer_122Hz=122.1Hz (16-bit)
x21j.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
x21j.menu.timer.timer_105Hz=104.6Hz (16-bit)
x21j.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
x21j.menu.timer.timer_81Hz=81.38Hz (16-bit)
x21j.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
x21j.menu.timer.timer_61Hz=61.04Hz (16-bit)
x21j.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
x21j.menu.timer.timer_31Hz=30.52Hz (16-bit)
x21j.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
x21j.menu.timer.timer_187500Hz=187500Hz (8-bit)
x21j.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
x21j.menu.timer.timer_93750Hz=93750Hz (8-bit)
x21j.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
x21j.menu.timer.timer_62500Hz=62500Hz (8-bit)
x21j.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
x21j.menu.timer.timer_37500Hz=37500Hz (8-bit)
x21j.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
x21j.menu.timer.timer_20833Hz=20833Hz (8-bit)
x21j.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
x21j.menu.timer.timer_12500Hz=12500Hz (8-bit)
x21j.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
x21j.menu.timer.timer_7500Hz=7500Hz (8-bit)
x21j.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
x21j.menu.timer.timer_4166Hz=4166Hz (8-bit)
x21j.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
x21j.menu.timer.timer_2930Hz=2930Hz (8-bit)
x21j.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
x21j.menu.timer.timer_1465Hz=1465Hz (8-bit)
x21j.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
x21j.menu.cpu.samd21j17a=SAMD21J17A
x21j.menu.cpu.samd21j17a.upload.maximum_size=122880
x21j.menu.cpu.samd21j17a.build.mcu=cortex-m0plus
x21j.menu.cpu.samd21j17a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samd21j17a.build.f_cpu=48000000L
x21j.menu.cpu.samd21j17a.build.usb_product="Xeno D21"
x21j.menu.cpu.samd21j17a.build.extra_flags=-D__SAMD21J17A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21j.menu.cpu.samd21j17a.build.ldscript=flash_128KB.ld
x21j.menu.cpu.samd21j17a.build.openocdscript=openocd_scripts/SAMD21J17A.cfg
x21j.menu.cpu.samd21j17a.bootloader.file=zero/binaries/sam_ba_SAMD21J17A.bin
x21j.menu.cpu.samd21j18a=SAMD21J18A
x21j.menu.cpu.samd21j18a.upload.maximum_size=253952
x21j.menu.cpu.samd21j18a.build.mcu=cortex-m0plus
x21j.menu.cpu.samd21j18a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samd21j18a.build.f_cpu=48000000L
x21j.menu.cpu.samd21j18a.build.usb_product="Xeno D21"
x21j.menu.cpu.samd21j18a.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21j.menu.cpu.samd21j18a.build.ldscript=flash_256KB.ld
x21j.menu.cpu.samd21j18a.build.openocdscript=openocd_scripts/SAMD21J18A.cfg
x21j.menu.cpu.samd21j18a.bootloader.file=zero/binaries/sam_ba_SAMD21J18A.bin
x21j.menu.cpu.samd21j15a=SAMD21J15A
x21j.menu.cpu.samd21j15a.upload.maximum_size=24576
x21j.menu.cpu.samd21j15a.build.mcu=cortex-m0plus
x21j.menu.cpu.samd21j15a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samd21j15a.build.f_cpu=48000000L
x21j.menu.cpu.samd21j15a.build.usb_product="Xeno D21"
x21j.menu.cpu.samd21j15a.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21j.menu.cpu.samd21j15a.build.ldscript=flash_32KB.ld
x21j.menu.cpu.samd21j15a.build.openocdscript=openocd_scripts/SAMD21J15A.cfg
x21j.menu.cpu.samd21j15a.bootloader.file=zero/binaries/sam_ba_SAMD21J15A.bin
x21j.menu.cpu.samd21j16a=SAMD21J16A
x21j.menu.cpu.samd21j16a.upload.maximum_size=57344
x21j.menu.cpu.samd21j16a.build.mcu=cortex-m0plus
x21j.menu.cpu.samd21j16a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samd21j16a.build.f_cpu=48000000L
x21j.menu.cpu.samd21j16a.build.usb_product="Xeno D21"
x21j.menu.cpu.samd21j16a.build.extra_flags=-D__SAMD21J16A__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21j.menu.cpu.samd21j16a.build.ldscript=flash_64KB.ld
x21j.menu.cpu.samd21j16a.build.openocdscript=openocd_scripts/SAMD21J16A.cfg
x21j.menu.cpu.samd21j16a.bootloader.file=zero/binaries/sam_ba_SAMD21J16A.bin
x21j.menu.cpu.saml21j17b=SAML21J17B
x21j.menu.cpu.saml21j17b.upload.maximum_size=122880
x21j.menu.cpu.saml21j17b.build.mcu=cortex-m0plus
x21j.menu.cpu.saml21j17b.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.saml21j17b.build.f_cpu=48000000L
x21j.menu.cpu.saml21j17b.build.usb_product="Xeno L21"
x21j.menu.cpu.saml21j17b.build.extra_flags=-D__SAML21J17B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21j.menu.cpu.saml21j17b.build.ldscript=flash_128KB.ld
x21j.menu.cpu.saml21j17b.build.openocdscript=openocd_scripts/SAML21J17B.cfg
x21j.menu.cpu.saml21j17b.bootloader.file=zero/binaries/sam_ba_SAML21J17B.bin
x21j.menu.cpu.saml21j18b=SAML21J18B
x21j.menu.cpu.saml21j18b.upload.maximum_size=253952
x21j.menu.cpu.saml21j18b.build.mcu=cortex-m0plus
x21j.menu.cpu.saml21j18b.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.saml21j18b.build.f_cpu=48000000L
x21j.menu.cpu.saml21j18b.build.usb_product="Xeno L21"
x21j.menu.cpu.saml21j18b.build.extra_flags=-D__SAML21J18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21j.menu.cpu.saml21j18b.build.ldscript=flash_256KB.ld
x21j.menu.cpu.saml21j18b.build.openocdscript=openocd_scripts/SAML21J18B.cfg
x21j.menu.cpu.saml21j18b.bootloader.file=zero/binaries/sam_ba_SAML21J18B.bin
x21j.menu.cpu.saml21j16b=SAML21J16B
x21j.menu.cpu.saml21j16b.upload.maximum_size=57344
x21j.menu.cpu.saml21j16b.build.mcu=cortex-m0plus
x21j.menu.cpu.saml21j16b.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.saml21j16b.build.f_cpu=48000000L
x21j.menu.cpu.saml21j16b.build.usb_product="Xeno L21"
x21j.menu.cpu.saml21j16b.build.extra_flags=-D__SAML21J16B__ {build.usb_flags} -DARM_MATH_CM0PLUS
x21j.menu.cpu.saml21j16b.build.ldscript=flash_64KB.ld
x21j.menu.cpu.saml21j16b.build.openocdscript=openocd_scripts/SAML21J16B.cfg
x21j.menu.cpu.saml21j16b.bootloader.file=zero/binaries/sam_ba_SAML21J16B.bin
x21j.menu.cpu.samc21j17a=SAMC21J17A
x21j.menu.cpu.samc21j17a.upload.maximum_size=122880
x21j.menu.cpu.samc21j17a.build.mcu=cortex-m0plus
x21j.menu.cpu.samc21j17a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samc21j17a.build.f_cpu=48000000L
x21j.menu.cpu.samc21j17a.build.usb_product="Xeno C21"
x21j.menu.cpu.samc21j17a.build.extra_flags=-D__SAMC21J17A__ -DARM_MATH_CM0PLUS
x21j.menu.cpu.samc21j17a.build.ldscript=flash_128KB.ld
x21j.menu.cpu.samc21j17a.build.openocdscript=openocd_scripts/SAMC21J17A.cfg
x21j.menu.cpu.samc21j17a.bootloader.file=zero/binaries/sam_ba_SAMC21J17A.bin
x21j.menu.cpu.samc21j18a=SAMC21J18A
x21j.menu.cpu.samc21j18a.upload.maximum_size=253952
x21j.menu.cpu.samc21j18a.build.mcu=cortex-m0plus
x21j.menu.cpu.samc21j18a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samc21j18a.build.f_cpu=48000000L
x21j.menu.cpu.samc21j18a.build.usb_product="Xeno C21"
x21j.menu.cpu.samc21j18a.build.extra_flags=-D__SAMC21J18A__ -DARM_MATH_CM0PLUS
x21j.menu.cpu.samc21j18a.build.ldscript=flash_256KB.ld
x21j.menu.cpu.samc21j18a.build.openocdscript=openocd_scripts/SAMC21J18A.cfg
x21j.menu.cpu.samc21j18a.bootloader.file=zero/binaries/sam_ba_SAMC21J18A.bin
x21j.menu.cpu.samc21j15a=SAMC21J15A
x21j.menu.cpu.samc21j15a.upload.maximum_size=24576
x21j.menu.cpu.samc21j15a.build.mcu=cortex-m0plus
x21j.menu.cpu.samc21j15a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samc21j15a.build.f_cpu=48000000L
x21j.menu.cpu.samc21j15a.build.usb_product="Xeno C21"
x21j.menu.cpu.samc21j15a.build.extra_flags=-D__SAMC21J15A__ -DARM_MATH_CM0PLUS
x21j.menu.cpu.samc21j15a.build.ldscript=flash_32KB.ld
x21j.menu.cpu.samc21j15a.build.openocdscript=openocd_scripts/SAMC21J15A.cfg
x21j.menu.cpu.samc21j15a.bootloader.file=zero/binaries/sam_ba_SAMC21J15A.bin
x21j.menu.cpu.samc21j16a=SAMC21J16A
x21j.menu.cpu.samc21j16a.upload.maximum_size=57344
x21j.menu.cpu.samc21j16a.build.mcu=cortex-m0plus
x21j.menu.cpu.samc21j16a.build.mathlib=arm_cortexM0l_math
x21j.menu.cpu.samc21j16a.build.f_cpu=48000000L
x21j.menu.cpu.samc21j16a.build.usb_product="Xeno C21"
x21j.menu.cpu.samc21j16a.build.extra_flags=-D__SAMC21J16A__ -DARM_MATH_CM0PLUS
x21j.menu.cpu.samc21j16a.build.ldscript=flash_64KB.ld
x21j.menu.cpu.samc21j16a.build.openocdscript=openocd_scripts/SAMC21J16A.cfg
x21j.menu.cpu.samc21j16a.bootloader.file=zero/binaries/sam_ba_SAMC21J16A.bin
x21j.menu.bootloader.8kb=8KB_BOOTLOADER
x21j.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
x21j.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
x21j.menu.bootloader.8kb.upload.tool=Fab_SAM_Arduino:bossac
x21j.menu.bootloader.8kb.upload.use_1200bps_touch=true
x21j.menu.bootloader.8kb.upload.wait_for_upload_port=true
x21j.menu.bootloader.8kb.upload.native_usb=true
x21j.menu.bootloader.8kb.upload.offset=0x2000
x21j.menu.bootloader.16kb=16KB_BOOTLOADER
x21j.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
x21j.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
x21j.menu.bootloader.16kb.upload.tool=Fab_SAM_Arduino:bossac
x21j.menu.bootloader.16kb.upload.use_1200bps_touch=true
x21j.menu.bootloader.16kb.upload.wait_for_upload_port=true
x21j.menu.bootloader.16kb.upload.native_usb=true
x21j.menu.bootloader.16kb.upload.offset=0x4000
x21j.menu.bootloader.0kb=NO_BOOTLOADER
x21j.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
x21j.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
x21j.menu.bootloader.0kb.upload.tool=openocd-withbootsize
x21j.menu.bootloader.0kb.upload.use_1200bps_touch=false
x21j.menu.bootloader.0kb.upload.wait_for_upload_port=false
x21j.menu.bootloader.0kb.upload.native_usb=false
x21j.menu.bootloader.0kb.upload.offset=0x0000
x21j.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
x21j.menu.serial.one_uart.build.serialcom_uart=ONE_UART
x21j.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
x21j.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
x21j.menu.serial.one_uart_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
x21j.menu.serial.one_uart_two_spi.build.serialcom_uart=ONE_UART
x21j.menu.serial.one_uart_two_spi.build.serialcom_wire=ONE_WIRE
x21j.menu.serial.one_uart_two_spi.build.serialcom_spi=TWO_SPI
x21j.menu.serial.one_uart_two_wire=ONE_UART_TWO_WIRE_ONE_SPI
x21j.menu.serial.one_uart_two_wire.build.serialcom_uart=ONE_UART
x21j.menu.serial.one_uart_two_wire.build.serialcom_wire=TWO_WIRE
x21j.menu.serial.one_uart_two_wire.build.serialcom_spi=ONE_SPI
x21j.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
x21j.menu.serial.two_uart.build.serialcom_uart=TWO_UART
x21j.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
x21j.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
x21j.menu.serial.two_uart_two_spi=TWO_UART_ONE_WIRE_TWO_SPI
x21j.menu.serial.two_uart_two_spi.build.serialcom_uart=TWO_UART
x21j.menu.serial.two_uart_two_spi.build.serialcom_wire=ONE_WIRE
x21j.menu.serial.two_uart_two_spi.build.serialcom_spi=TWO_SPI
x21j.menu.serial.two_uart_two_wire=TWO_UART_TWO_WIRE_ONE_SPI
x21j.menu.serial.two_uart_two_wire.build.serialcom_uart=TWO_UART
x21j.menu.serial.two_uart_two_wire.build.serialcom_wire=TWO_WIRE
x21j.menu.serial.two_uart_two_wire.build.serialcom_spi=ONE_SPI
x21j.menu.serial.three_uart=THREE_UART_ONE_WIRE_ONE_SPI
x21j.menu.serial.three_uart.build.serialcom_uart=THREE_UART
x21j.menu.serial.three_uart.build.serialcom_wire=ONE_WIRE
x21j.menu.serial.three_uart.build.serialcom_spi=ONE_SPI
x21j.menu.serial.three_uart_two_spi=THREE_UART_ONE_WIRE_TWO_SPI
x21j.menu.serial.three_uart_two_spi.build.serialcom_uart=THREE_UART
x21j.menu.serial.three_uart_two_spi.build.serialcom_wire=ONE_WIRE
x21j.menu.serial.three_uart_two_spi.build.serialcom_spi=TWO_SPI
x21j.menu.serial.three_uart_two_wire=THREE_UART_TWO_WIRE_ONE_SPI
x21j.menu.serial.three_uart_two_wire.build.serialcom_uart=THREE_UART
x21j.menu.serial.three_uart_two_wire.build.serialcom_wire=TWO_WIRE
x21j.menu.serial.three_uart_two_wire.build.serialcom_spi=ONE_SPI
x21j.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
x21j.menu.serial.no_uart.build.serialcom_uart=NO_UART
x21j.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
x21j.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
x21j.menu.usb.cdc=CDC_ONLY
x21j.menu.usb.cdc.build.usbcom=CDC_ONLY
x21j.menu.usb.cdc.build.pid=0x6557
x21j.menu.usb.cdc_hid=CDC_HID
x21j.menu.usb.cdc_hid.build.usbcom=CDC_HID
x21j.menu.usb.cdc_hid.build.pid=0x6856
x21j.menu.usb.withcdc=WITH_CDC
x21j.menu.usb.withcdc.build.usbcom=WITH_CDC
x21j.menu.usb.withcdc.build.pid=0x6B41
x21j.menu.usb.hid=HID_ONLY
x21j.menu.usb.hid.build.usbcom=HID_ONLY
x21j.menu.usb.hid.build.pid=0x6B40
x21j.menu.usb.nocdc=WITHOUT_CDC
x21j.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
x21j.menu.usb.nocdc.build.pid=0x6A0C
x21j.menu.usb.none=USB_DISABLED
x21j.menu.usb.none.build.usbcom=USB_DISABLED
x21j.menu.usb.none.build.pid=0x6856

# Generic D51G
d51g.name=Generic D51G
d51g.vid.0=0x16D0
d51g.pid.0=0x7557
d51g.vid.1=0x16D0
d51g.pid.1=0x7856
d51g.vid.2=0x16D0
d51g.pid.2=0x7B41
d51g.vid.3=0x16D0
d51g.pid.3=0x7B40
d51g.vid.4=0x16D0
d51g.pid.4=0x7A0C
d51g.vid.5=0x16D0
d51g.pid.5=0x7856
d51g.build.usb_manufacturer="Fab Foundation"

# KH mod
#d51g.build.board=SAMD_ZERO
d51g.build.board=__SAMD51__
######

d51g.build.core=arduino

# KH mod
#d51g.build.variant=Generic_D51G
d51g.build.variant=Generic_xx1G
######

