khoih-prog/EthernetWebServer/Packages_Patches/Fab_SAM_Arduino/hardware/samd/1.9.0/boards.txt
d51g.build.variant_system_lib=
d51g.build.vid=0x16D0
d51g.upload.protocol=sam-ba
d51g.bootloader.tool=openocd-withbootsize
d51g.menu.float.default=Print & String use auto-promoted doubles only
d51g.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
d51g.menu.float.print=Print uses separate singles and doubles
d51g.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
d51g.menu.float.string=String uses separate singles and doubles
d51g.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
d51g.menu.float.both=Print & String use separate singles and doubles
d51g.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
d51g.menu.config.disabled=config.h disabled
d51g.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
d51g.menu.config.enabled=config.h enabled (mostly code size reductions)
d51g.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
d51g.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
d51g.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d51g.menu.clock.internal=INTERNAL_OSCILLATOR
d51g.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
d51g.menu.clock.crystal_32k=32KHZ_CRYSTAL
d51g.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
d51g.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
d51g.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
d51g.menu.timer.timer_732Hz=732.4Hz (16-bit)
d51g.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
d51g.menu.timer.timer_366Hz=366.2Hz (16-bit)
d51g.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
d51g.menu.timer.timer_244Hz=244.1Hz (16-bit)
d51g.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
d51g.menu.timer.timer_183Hz=183.1Hz (16-bit)
d51g.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
d51g.menu.timer.timer_146Hz=146.5Hz (16-bit)
d51g.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
d51g.menu.timer.timer_122Hz=122.1Hz (16-bit)
d51g.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
d51g.menu.timer.timer_105Hz=104.6Hz (16-bit)
d51g.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
d51g.menu.timer.timer_81Hz=81.38Hz (16-bit)
d51g.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
d51g.menu.timer.timer_61Hz=61.04Hz (16-bit)
d51g.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
d51g.menu.timer.timer_31Hz=30.52Hz (16-bit)
d51g.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
d51g.menu.timer.timer_187500Hz=187500Hz (8-bit)
d51g.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
d51g.menu.timer.timer_93750Hz=93750Hz (8-bit)
d51g.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
d51g.menu.timer.timer_62500Hz=62500Hz (8-bit)
d51g.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
d51g.menu.timer.timer_37500Hz=37500Hz (8-bit)
d51g.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
d51g.menu.timer.timer_20833Hz=20833Hz (8-bit)
d51g.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
d51g.menu.timer.timer_12500Hz=12500Hz (8-bit)
d51g.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
d51g.menu.timer.timer_7500Hz=7500Hz (8-bit)
d51g.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
d51g.menu.timer.timer_4166Hz=4166Hz (8-bit)
d51g.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
d51g.menu.timer.timer_2930Hz=2930Hz (8-bit)
d51g.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
d51g.menu.timer.timer_1465Hz=1465Hz (16-bit)
d51g.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
d51g.menu.cpu.samd51g18a_120=SAMD51G18A_120MHz
d51g.menu.cpu.samd51g18a_120.upload.maximum_size=253952
d51g.menu.cpu.samd51g18a_120.build.mcu=cortex-m4
d51g.menu.cpu.samd51g18a_120.build.mathlib=arm_cortexM4lf_math
d51g.menu.cpu.samd51g18a_120.build.f_cpu=120000000L
d51g.menu.cpu.samd51g18a_120.build.usb_product="Xeno Mini D51"

# KH mod
#d51g.menu.cpu.samd51g18a_120.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
#d51g.menu.cpu.samd51g18a_120.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4 -D__SAMD51__
d51g.menu.cpu.samd51g18a_120.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4 -D__SAMD51__
######


d51g.menu.cpu.samd51g18a_120.build.ldscript=flash_m4f_256KB.ld
d51g.menu.cpu.samd51g18a_120.build.openocdscript=openocd_scripts/SAMD51G18A.cfg
d51g.menu.cpu.samd51g18a_120.bootloader.file=zero/binaries/sam_ba_SAMD51G18A.bin
d51g.menu.cpu.samd51g18a_48=SAMD51G18A_48MHz
d51g.menu.cpu.samd51g18a_48.upload.maximum_size=253952
d51g.menu.cpu.samd51g18a_48.build.mcu=cortex-m4
d51g.menu.cpu.samd51g18a_48.build.mathlib=arm_cortexM4lf_math
d51g.menu.cpu.samd51g18a_48.build.f_cpu=48000000L
d51g.menu.cpu.samd51g18a_48.build.usb_product="Xeno Mini D51"

# KH mod
#d51g.menu.cpu.samd51g18a_48.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
d51g.menu.cpu.samd51g18a_48.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4 -D__SAMD51__
######

d51g.menu.cpu.samd51g18a_48.build.ldscript=flash_m4f_256KB.ld
d51g.menu.cpu.samd51g18a_48.build.openocdscript=openocd_scripts/SAMD51G18A.cfg
d51g.menu.cpu.samd51g18a_48.bootloader.file=zero/binaries/sam_ba_SAMD51G18A.bin
d51g.menu.cpu.samd51g19a_120=SAMD51G19A_120MHz
d51g.menu.cpu.samd51g19a_120.upload.maximum_size=516096
d51g.menu.cpu.samd51g19a_120.build.mcu=cortex-m4
d51g.menu.cpu.samd51g19a_120.build.mathlib=arm_cortexM4lf_math
d51g.menu.cpu.samd51g19a_120.build.f_cpu=120000000L
d51g.menu.cpu.samd51g19a_120.build.usb_product="Xeno Mini D51"

# KH mod
#d51g.menu.cpu.samd51g19a_120.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
d51g.menu.cpu.samd51g19a_120.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4 -D__SAMD51__
######

d51g.menu.cpu.samd51g19a_120.build.ldscript=flash_m4f_512KB.ld
d51g.menu.cpu.samd51g19a_120.build.openocdscript=openocd_scripts/SAMD51G19A.cfg
d51g.menu.cpu.samd51g19a_120.bootloader.file=zero/binaries/sam_ba_SAMD51G19A.bin
d51g.menu.cpu.samd51g19a_48=SAMD51G19A_48MHz
d51g.menu.cpu.samd51g19a_48.upload.maximum_size=516096
d51g.menu.cpu.samd51g19a_48.build.mcu=cortex-m4
d51g.menu.cpu.samd51g19a_48.build.mathlib=arm_cortexM4lf_math
d51g.menu.cpu.samd51g19a_48.build.f_cpu=48000000L
d51g.menu.cpu.samd51g19a_48.build.usb_product="Xeno Mini D51"

# KH mod
#d51g.menu.cpu.samd51g19a_48.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
d51g.menu.cpu.samd51g19a_48.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4 -D__SAMD51__
######

d51g.menu.cpu.samd51g19a_48.build.ldscript=flash_m4f_512KB.ld
d51g.menu.cpu.samd51g19a_48.build.openocdscript=openocd_scripts/SAMD51G19A.cfg
d51g.menu.cpu.samd51g19a_48.bootloader.file=zero/binaries/sam_ba_SAMD51G19A.bin
d51g.menu.bootloader.8kb=8KB_BOOTLOADER
d51g.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
d51g.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
d51g.menu.bootloader.8kb.upload.tool=Fab_SAM_Arduino:bossac
d51g.menu.bootloader.8kb.upload.use_1200bps_touch=true
d51g.menu.bootloader.8kb.upload.wait_for_upload_port=true
d51g.menu.bootloader.8kb.upload.native_usb=true
d51g.menu.bootloader.8kb.upload.offset=0x2000
d51g.menu.bootloader.16kb=16KB_BOOTLOADER
d51g.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
d51g.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
d51g.menu.bootloader.16kb.upload.tool=Fab_SAM_Arduino:bossac
d51g.menu.bootloader.16kb.upload.use_1200bps_touch=true
d51g.menu.bootloader.16kb.upload.wait_for_upload_port=true
d51g.menu.bootloader.16kb.upload.native_usb=true
d51g.menu.bootloader.16kb.upload.offset=0x4000
d51g.menu.bootloader.0kb=NO_BOOTLOADER
d51g.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d51g.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d51g.menu.bootloader.0kb.upload.tool=openocd-withbootsize
d51g.menu.bootloader.0kb.upload.use_1200bps_touch=false
d51g.menu.bootloader.0kb.upload.wait_for_upload_port=false
d51g.menu.bootloader.0kb.upload.native_usb=false
d51g.menu.bootloader.0kb.upload.offset=0x0000
d51g.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
d51g.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d51g.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d51g.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
d51g.menu.serial.one_uart_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
d51g.menu.serial.one_uart_two_spi.build.serialcom_uart=ONE_UART
d51g.menu.serial.one_uart_two_spi.build.serialcom_wire=ONE_WIRE
d51g.menu.serial.one_uart_two_spi.build.serialcom_spi=TWO_SPI
d51g.menu.serial.one_uart_two_wire=ONE_UART_TWO_WIRE_ONE_SPI
d51g.menu.serial.one_uart_two_wire.build.serialcom_uart=ONE_UART
d51g.menu.serial.one_uart_two_wire.build.serialcom_wire=TWO_WIRE
d51g.menu.serial.one_uart_two_wire.build.serialcom_spi=ONE_SPI
d51g.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
d51g.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d51g.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
d51g.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
d51g.menu.serial.two_uart_two_spi=TWO_UART_ONE_WIRE_TWO_SPI
d51g.menu.serial.two_uart_two_spi.build.serialcom_uart=TWO_UART
d51g.menu.serial.two_uart_two_spi.build.serialcom_wire=ONE_WIRE
d51g.menu.serial.two_uart_two_spi.build.serialcom_spi=TWO_SPI
d51g.menu.serial.two_uart_two_wire=TWO_UART_TWO_WIRE_ONE_SPI
d51g.menu.serial.two_uart_two_wire.build.serialcom_uart=TWO_UART
d51g.menu.serial.two_uart_two_wire.build.serialcom_wire=TWO_WIRE
d51g.menu.serial.two_uart_two_wire.build.serialcom_spi=ONE_SPI
d51g.menu.serial.three_uart=THREE_UART_ONE_WIRE_ONE_SPI
d51g.menu.serial.three_uart.build.serialcom_uart=THREE_UART
d51g.menu.serial.three_uart.build.serialcom_wire=ONE_WIRE
d51g.menu.serial.three_uart.build.serialcom_spi=ONE_SPI
d51g.menu.serial.three_uart_two_spi=THREE_UART_ONE_WIRE_TWO_SPI
d51g.menu.serial.three_uart_two_spi.build.serialcom_uart=THREE_UART
d51g.menu.serial.three_uart_two_spi.build.serialcom_wire=ONE_WIRE
d51g.menu.serial.three_uart_two_spi.build.serialcom_spi=TWO_SPI
d51g.menu.serial.three_uart_two_wire=THREE_UART_TWO_WIRE_ONE_SPI
d51g.menu.serial.three_uart_two_wire.build.serialcom_uart=THREE_UART
d51g.menu.serial.three_uart_two_wire.build.serialcom_wire=TWO_WIRE
d51g.menu.serial.three_uart_two_wire.build.serialcom_spi=ONE_SPI
d51g.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
d51g.menu.serial.no_uart.build.serialcom_uart=NO_UART
d51g.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
d51g.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
d51g.menu.usb.cdc=CDC_ONLY
d51g.menu.usb.cdc.build.usbcom=CDC_ONLY
d51g.menu.usb.cdc.build.pid=0x7557
d51g.menu.usb.cdc_hid=CDC_HID
d51g.menu.usb.cdc_hid.build.usbcom=CDC_HID
d51g.menu.usb.cdc_hid.build.pid=0x7856
d51g.menu.usb.withcdc=WITH_CDC
d51g.menu.usb.withcdc.build.usbcom=WITH_CDC
d51g.menu.usb.withcdc.build.pid=0x7B41
d51g.menu.usb.hid=HID_ONLY
d51g.menu.usb.hid.build.usbcom=HID_ONLY
d51g.menu.usb.hid.build.pid=0x7B40
d51g.menu.usb.nocdc=WITHOUT_CDC
d51g.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d51g.menu.usb.nocdc.build.pid=0x7A0C
d51g.menu.usb.none=USB_DISABLED
d51g.menu.usb.none.build.usbcom=USB_DISABLED
d51g.menu.usb.none.build.pid=0x7856

# Generic D51J
d51j.name=Generic D51J
d51j.vid.0=0x16D0
d51j.pid.0=0x8557
d51j.vid.1=0x16D0
d51j.pid.1=0x8856
d51j.vid.2=0x16D0
d51j.pid.2=0x8B41
d51j.vid.3=0x16D0
d51j.pid.3=0x8B40
d51j.vid.4=0x16D0
d51j.pid.4=0x8A0C
d51j.vid.5=0x16D0
d51j.pid.5=0x8856
d51j.build.usb_manufacturer="Fab Foundation"

# KH mod
#d51j.build.board=SAMD_ZERO
d51j.build.board=__SAMD51__
######

